#### Terraform Plan for `production` K8s Addons (Phase 2) 📖

<details>
<summary>Show Plan</summary>

```terraform
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=305032652600]
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.eks: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_cloudwatch_metric_alarm.high_error_rate will be created
  + resource "aws_cloudwatch_metric_alarm" "high_error_rate" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when 5xx error count exceeds 10 in 5 minutes"
      + alarm_name                            = "production-fiap-high-error-rate"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "HTTPCode_Target_5XX_Count"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Sum"
      + tags                                  = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                              = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + threshold                             = 10
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.high_latency will be created
  + resource "aws_cloudwatch_metric_alarm" "high_latency" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Alert when P95 latency exceeds 2 seconds"
      + alarm_name                            = "production-fiap-high-latency"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + extended_statistic                    = "p95"
      + id                                    = (known after apply)
      + metric_name                           = "TargetResponseTime"
      + namespace                             = "AWS/ApplicationELB"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + tags                                  = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                              = {
          + "ManagedBy" = "terraform"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + threshold                             = 2
      + treat_missing_data                    = "notBreaching"
    }

  # aws_sns_topic.cloudwatch_alarms will be created
  + resource "aws_sns_topic" "cloudwatch_alarms" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "production-fiap-cloudwatch-alarms"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "ManagedBy" = "terraform"
          + "Name"      = "production-fiap-cloudwatch-alarms"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Name"      = "production-fiap-cloudwatch-alarms"
          + "Phase"     = "3"
          + "Project"   = "fiap-tech-challenge"
          + "Team"      = "fiap-pos-grad"
        }
      + tracing_config              = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_lb_controller_status    = "Instalado"
  + cloudwatch_alarms_sns_topic = (known after apply)
  + external_secrets_namespace  = "external-secrets-system"
  + external_secrets_status     = "Instalado (v0.10.4)"

Error: Unsupported attribute

  on main.tf line 69, in provider "kubernetes":
  69:   host                   = data.terraform_remote_state.eks.outputs.cluster_endpoint
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_endpoint".

Error: Unsupported attribute

  on main.tf line 70, in provider "kubernetes":
  70:   cluster_ca_certificate = base64decode(data.terraform_remote_state.eks.outputs.cluster_certificate_authority)
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_certificate_authority".

Error: Unsupported attribute

  on main.tf line 75, in provider "kubernetes":
  75:     args        = ["eks", "get-token", "--cluster-name", data.terraform_remote_state.eks.outputs.cluster_name]
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_name".

Error: Unsupported attribute

  on main.tf line 82, in provider "helm":
  82:     host                   = data.terraform_remote_state.eks.outputs.cluster_endpoint
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_endpoint".

Error: Unsupported attribute

  on main.tf line 83, in provider "helm":
  83:     cluster_ca_certificate = base64decode(data.terraform_remote_state.eks.outputs.cluster_certificate_authority)
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_certificate_authority".

Error: Unsupported attribute

  on main.tf line 88, in provider "helm":
  88:       args        = ["eks", "get-token", "--cluster-name", data.terraform_remote_state.eks.outputs.cluster_name]
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_name".

Error: Unsupported attribute

  on main.tf line 98, in locals:
  98:   cluster_name               = data.terraform_remote_state.eks.outputs.cluster_name
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "cluster_name".

Error: Unsupported attribute

  on main.tf line 99, in locals:
  99:   vpc_id                     = data.terraform_remote_state.eks.outputs.vpc_id
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "vpc_id".

Error: Unsupported attribute

  on main.tf line 100, in locals:
 100:   aws_lb_controller_role_arn = data.terraform_remote_state.eks.outputs.aws_lb_controller_role_arn
    ├────────────────
    │ data.terraform_remote_state.eks.outputs is object with no attributes

This object does not have an attribute named "aws_lb_controller_role_arn".
::error::Terraform exited with code 1.

```

</details>

*Pushed by: @finhaa, Action: `pull_request`*